package com.huihe.eg.comm;

public enum UserEum {
    user_10000(10000, "用户已存在"), user_100001(100001, "昵称未传"),
    user_10002(10002, "登录类型未传"), user_10003(10003, "请输入账号"),
    user_10004(10004, "请输入密码"), user_10005(10005, "账号或密码错误"),
    user_10006(10006, "手机号码不正确"), user_10007(10007, "请输入验证码"),
    user_10008(10008, "请输入验证码"), user_10009(10009, "操作过于频繁，请稍后再试"),
    user_10010(10010, "请重新获取验证码"), user_10011(10011, "验证码错误"),
    user_10012(10012, "发送验证码失败"), user_10013(10013, "登录失败"),
    user_10014(10014, "注册失败"), user_10015(10015, "请输入手机号"),
    user_10016(10016, "该账户已存在,请前往登录"), user_10017(10017, "请输入正确的邮箱"),
    user_10018(10018, "账号不存在,请前往注册"), user_10019(10019, "请输入邮箱号"),
    user_10020(10020, "清空失败"),user_10021(10021, "用户资料修改失败"),
    user_10022(10022, "偏好获取失败"),user_10023(10023, "用户偏好选择失败"),
    user_10024(10024, "邀请失败"),user_10025(10025, "通讯录不存在"),
    user_10026(10026, "短信发送失败"),user_10027(10027, "短信发送失败"),
    user_10028(10028, "签到失败"),user_10029(10029, "参数错误"),
    user_10030(10030, "您未成为助学师,请前往注册"),user_10031(10031, "优惠卷不存在,请稍后再试"),
    user_10032(10032, "该手机号已被绑定"),user_10033(10033, "安全码错误"),
    user_10034(10034, "帐号已被冻结,请联系管理员"),user_10035(10035, "Token过期,请重新获取"),
    user_10036(10036, "等待扫码"),user_10037(10037, "无订单记录"),
    user_10038(10038, "所购课程不是该机构"),user_10039(10038, "预约机构已存在"),
    user_10040(10040, "邀请人未成为机构招募师"),user_10041(10041, "该帐号已是助学师"),
    user_10042(10042, "您已申请过该身份,请勿重复提交"),user_10043(10043, "课程已核销过"),
    user_10044(10044, "查无此类型"),user_10045(10045, "您已购买过体验卡"),
    user_10046(10046, "该帐号已注销"),user_10047(10047, "您已经领取过了"),
    user_10048(10048, "参加拼团失败，请联系客服"),user_10049(10049, "您已参加过拼团"),
    user_10050(10050, "该团已达到人数上限"),user_10051(10051, "请在app上发起拼团"),
    user_10052(10052, "该课程只能购买一次"),user_10053(10053, "该团已过期或未开启"),
    user_10054(10054, "您已经确认过了"),user_10055(10055, "您已经支付过了"),
    user_10056(10056, "该课程已上过无法取消"),user_10057(10057, "该课程已被预约，请联系学生取消"),
    user_10058(10058, "支付金额非法"),user_10059(10059, "未找到该机构，请输入正确的机构名"),
    user_10060(10060, "未找到该商品，请输入正确的商品名"),user_10061(10061, "未找到该用户，请输入正确的用户名"),
    user_10062(10062, "非优惠券持有者"),user_10063(10063, "您已购买过，请支付定金"),
    user_10064(10064, "非订单持有者"),user_10065(10065, "同机构只能兑换一次")

    ;
    /**
     * 结果码
     */
    private Integer code;

    /**
     * 结果描述
     */
    private String desc;

    /**
     * 获取结果码
     *
     * @param code 待查询code
     * @return 对应的结果码
     */
    public static UserEum getByCode(String code) {
        for (UserEum resultCode : values()) {
            if (resultCode.getCode().equals(code)) {
                return resultCode;
            }
        }
        return null;
    }

    /**
     * @param code
     * @param desc
     */
    private UserEum(Integer code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    /**
     * @return the code
     */
    public Integer getCode() {
        return code;
    }

    /**
     * @return the desc
     */
    public String getDesc() {
        return desc;
    }
}
